In [1]:
import pandas as pd
import numpy as np

# Jupyter 参数设置
# 导入设置后， 在一个cell 可以输出多个值
# 就没有必要用不同的cell去运行
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = 'all'

Pandas 的两种数据结构 `Series` 和 `DataFrame`
## Series

In [2]:
from pandas import Series

In [175]:
tmp1 = Series(['this', 'is', 'tmp'])
tmp1

tmp2 = Series(['test', 'file'], index= ['a', 'b'])
tmp2

0    this
1      is
2     tmp
dtype: object

a    test
b    file
dtype: object

In [176]:
tmp2['a']

'test'

也可以通过字典来创建Series

In [177]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
tmp3 = pd.Series(sdata)
tmp3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

## DataFrame

In [178]:
from pandas import DataFrame

### DataFrame 导入数据
DataFrame 可以从很多种数据中导入数据，比如说可以从excel、json、dict、list、Series 等等数据格式中导入数据。最常用的几个导入数据的命令如下：
```python
pd.read_csv(filename)：从CSV文件导入数据
pd.read_table(filename)：从限定分隔符的文本文件导入数据
pd.read_excel(filename)：从Excel文件导入数据
pd.read_sql(query, connection_object)：从SQL表/库导入数据
pd.read_json(json_string)：从JSON格式的字符串导入数据
pd.read_html(url)：解析URL、字符串或者HTML文件，抽取其中的tables表格
pd.read_clipboard()：从你的粘贴板获取内容，并传给read_table()
pd.DataFrame(dict)：从字典对象导入数据，Key是列名，Value是数据
```

In [179]:
# 从字典里导入数据
print('从字典里导入数据')
dict_data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.0]}
df1 = pd.DataFrame(dict_data, columns = ['year', 'state', 'pop'])
df1

print('从json中导入数据')
# 从json中导入数据
df2 = pd.read_json('pd_data/tmp.json')
df2

print('从csv中导入数据')
# 从csv中导入数据
df3 = pd.read_csv('pd_data/tmp.csv')

# df3 = df3.set_index('人物')
df3

从字典里导入数据

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.0

从json中导入数据

                            person_1 person_2 person_3
music                    [pop, rock]  [dance]   [jazz]
musical_instruction  [paino, guitar]      NaN      NaN

从csv中导入数据

        人物    爱好  喜欢吃什么
0  person1  打羽毛球  火锅，川菜
1  person2    睡觉    广东菜

In [180]:
### 选取其中一列
df1['state']

### 选取行和列
df1[:3]['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

0    Ohio
1    Ohio
2    Ohio
Name: state, dtype: object

### 基础属性

In [182]:
df1.shape
df1.dtypes
df1.ndim
df1.index
df1.columns
df1.values

(6, 3)

year       int64
state     object
pop      float64
dtype: object

2

RangeIndex(start=0, stop=6, step=1)

Index(['year', 'state', 'pop'], dtype='object')

array([[2000, 'Ohio', 1.5],
       [2001, 'Ohio', 1.7],
       [2002, 'Ohio', 3.6],
       [2001, 'Nevada', 2.4],
       [2002, 'Nevada', 2.9],
       [2003, 'Nevada', 3.0]], dtype=object)

### 整体情况

In [157]:
df1.head(3)
df1.tail(3)
df1.info()
df1.describe()

   year state  pop
0  2000  Ohio  1.5
1  2001  Ohio  1.7
2  2002  Ohio  3.6

   year   state  pop
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.0

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   year    6 non-null      int64
 1   state   6 non-null      object
 2   pop     6 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 272.0+ bytes

              year       pop
count     6.000000  6.000000
mean   2001.500000  2.516667
std       1.048809  0.808497
min    2000.000000  1.500000
25%    2001.000000  1.875000
50%    2001.500000  2.650000
75%    2002.000000  2.975000
max    2003.000000  3.600000

### 检索数据
检索数据有以下三种方式 `loc`， `iloc`，`boolean`。
`loc`与`iloc`的微小差别，从以下例子可以看出细小差别。

冒号选择的数据在`loc`里面是闭合的（即会选择冒号后面的数据）

```python
# select by position: iloc
df.iloc[ ] #  行列的查找都智能用他们的序数

# mixed selection 
df.loc[ ]  # mix， 行row的选择可以用序数也可以用行的名称； 列column的查找智能用列的名字！

# boolean indexing
df[df>=3] # 选出df中大于3的数据
```

In [100]:
df1

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.0

In [101]:
df1.loc[0:4, ['year','pop']] # 从0到4 [0,4] 来选择行， loc用括号是闭合的
df1.iloc[0:4, 0:2] # 从[0,4)来选择行   iloc来选择是开的 !

   year  pop
0  2000  1.5
1  2001  1.7
2  2002  3.6
3  2001  2.4
4  2002  2.9

   year   state
0  2000    Ohio
1  2001    Ohio
2  2002    Ohio
3  2001  Nevada

#### 布尔索引

In [136]:
# 用条件来检索，筛选出pop 列中大于3的数据
# & 且
# ｜ 或
df1
df1[(df1.loc[:,'pop'] >= 2)&(df1.loc[:,'state']=='Nevada')]

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.0

   year   state  pop
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.0

In [158]:
# 以下为扩展知识
# 用条件来检索，筛选出state列中 字符长度大于4的数据
df1[df1.loc[:,'state'].str.len() >4] 
df1.loc[:,'state'].apply(lambda x : len(x) > 4)

   year   state  pop
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.0

0    False
1    False
2    False
3     True
4     True
5     True
Name: state, dtype: bool

### 数据筛选

In [145]:
df1.sort_values(by = 'pop', ascending=False)

   year   state  pop
2  2002    Ohio  3.6
5  2003  Nevada  3.0
4  2002  Nevada  2.9
3  2001  Nevada  2.4
1  2001    Ohio  1.7
0  2000    Ohio  1.5